app/views/account_movements/index.html.erb


<% if !@investor.account_movements.empty? %>
---
SELECT "account_movements".* FROM "account_movements"