app/views/account_movements/list_investor.html.erb

  <strong class="titulo_campo">Investor:</strong>
  <%=  @account_movements.any? ? @account_movements[0].investor.full_name : ''%>
---
SELECT "investors".* FROM "investors" WHERE (id <> 99999)