app/views/account_movements/new.html.erb

SELECT "users".* FROM "users"
---

<%= select_tag :user,options_for_select(User.all.map {|s| [s.email]}) , :include_blank => true  %>