app/controllers/account_movements_controller.rb

SELECT "account_movements".* FROM "account_movements"
---
  def index
    @account_movements = AccountMovement.all

SELECT  "investors".* FROM "investors" WHERE "investors"."id" = ? LIMIT 1  [["id", 5]]
---
  def new_id
    @investor = Investor.find(params[:id])

INSERT INTO "account_movements" ("investor_id", "value", "value_date", "movement_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["investor_id", 6], ["value", 10.0], ["value_date", "2015-12-21"], ["movement_date", "2015-12-21"], ["created_at", "2015-12-21 00:58:52.724862"], ["updated_at", "2015-12-21 00:58:52.724862"]]
---
  def create
    @account_movement = AccountMovement.new(account_movement_params)

    respond_to do |format|
      if @account_movement.save

SELECT "account_movements".* FROM "account_movements" WHERE "account_movements"."investor_id" = ? AND "account_movements"."investor_id" = ?  [["investor_id", 7], ["investor_id", 7]]
SELECT "investors".* FROM "investors" WHERE (id <> 99999)
---
  def list_investor
    @account_movements = AccountMovement.where("investor_id = ?",params[:id_investor])

SELECT  "account_movements".* FROM "account_movements" WHERE "account_movements"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_account_movement
      @account_movement = AccountMovement.find(params[:id])