app/controllers/account_movements_controller.rb

  def show
    @account_movement = @investor.account_movements.find(params[:id])
---
SELECT "account_movements".* FROM "account_movements" WHERE "account_movements"."investor_id" = ?  [["investor_id", 6]]