app/controllers/deals_controller.rb

SELECT "deals".* FROM "deals"
---
  def index
    @deals = Deal.all

SELECT  "investors".* FROM "investors" WHERE "investors"."id" = ? LIMIT 1  [["id", nil]]
SELECT "account_movements".* FROM "account_movements" WHERE (investor_id<>23)
INSERT INTO "account_movements" ("value", "value_date", "movement_date", "investor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["value", 12.0], ["value_date", "2015-11-30"], ["movement_date", "2015-11-30"], ["investor_id", 1], ["created_at", "2015-11-30 23:06:21.850970"], ["updated_at", "2015-11-30 23:06:21.850970"]]
INSERT INTO "deals" ("value", "confirmed", "confirmation_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["value", 1], ["confirmed", "f"], ["confirmation_date", "2015-11-29"], ["created_at", "2015-11-29 19:32:15.605836"], ["updated_at", "2015-11-29 19:32:15.605836"]]
---
  def create
    #verifica se o investidor tem fundos suficientes na conta
    @investor = Investor.find(params["deal"]["investor_id"])
    if @investor.saldo >= deal_params[:value].to_f then
      #cria um registo a debito na conta
      @account_movement = AccountMovement.new
      @account_movement.value= - deal_params[:value].to_f
      @account_movement.value_date= Date.today
      @account_movement.movement_date= Date.today
      @account_movement.investor_id= deal_params[:investor_id]
      @account_movement.save

SELECT  "deals".* FROM "deals" WHERE "deals"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_deal
      @deal = Deal.find(params[:id])