app/controllers/entrepreneurs_controller.rb

  def index
    @entrepreneurs = Entrepreneur.all
---
SELECT "entrepreneurs".* FROM "entrepreneurs"

  def show
    @entrepreneur = Entrepreneur.find(params[:id])
---
SELECT  "entrepreneurs".* FROM "entrepreneurs" WHERE "entrepreneurs"."id" = ? LIMIT 1  [["id", 0]]

  def new_by_user
    user = User.find params[:user_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 73]]

  def create
    authorize Entrepreneur
    @entrepreneur = Entrepreneur.new(entrepreneur_params)

    respond_to do |format|
      if @entrepreneur.save
---
INSERT INTO "entrepreneurs" ("full_name", "address", "zip_code", "town", "country", "fiscal_number", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_entrepreneur
      @entrepreneur = Entrepreneur.find(params[:id])
---
SELECT  "entrepreneurs".* FROM "entrepreneurs" WHERE "entrepreneurs"."id" = ? LIMIT 1  [["id", 2]]