app/controllers/investors_controller.rb

SELECT "investors".* FROM "investors"
---
  def index
    authorize Investor
    @investors = Investor.search(params[:search])

SELECT  "investors".* FROM "investors" WHERE "investors"."id" = ? LIMIT 1  [["id", 0]]
---
  def show
    @investor = Investor.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 6]]
---
  def new_by_user
    #authorize Investor
    #@investor = Investor.new
    #@investor.user_id = @user.id
    user = User.find params[:user_id]

INSERT INTO "investors" ("full_name", "address", "zip_code", "town", "country", "fiscal_number", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    authorize Investor
    @investor = Investor.new(investor_params)
    respond_to do |format|
      if @investor.save

SELECT  "investors".* FROM "investors" WHERE "investors"."id" = ? LIMIT 1  [["id", 10]]
DELETE FROM "investors" WHERE "investors"."id" = ?  [["id", 10]]
---
  def destroy
    @investor = Investor.find(params[:id])
    authorize @investor
    @investor.destroy

SELECT "investors".* FROM "investors" WHERE (full_name LIKE '%eee%')
---
  def search
    authorize Investor
    @investors = Investor.search(params[:search])

SELECT  "investors".* FROM "investors" WHERE "investors"."id" = ? LIMIT 1  [["id", nil]]
---
    def set_investor
      @investor = Investor.find(params[:id])