app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def index_investor
    @projects = Project.all

INSERT INTO "projects" ("value", "description", "duration", "start_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["value", 1000000], ["description", "Arrumar carros"], ["duration", 48], ["start_date", "2015-01-01"], ["created_at", "2015-11-28 22:15:44.638163"], ["updated_at", "2015-11-28 22:15:44.638163"]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

UPDATE "projects" SET "status" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["status", 1], ["updated_at", "2015-12-05 23:59:43.141760"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @project.update(project_params)