app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(secure_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", 2], ["updated_at", "2015-11-22 14:54:41.811324"], ["id", 2]]

  def destroy
    user = User.find(params[:id])
    user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 11]]